#比较运算符:  ==  !=  <  >  <=  >=
#算数运算符：+ - * /  ^
#逻辑运算符：  and  or  not    优先级的顺序  （）  >  not  >  and  >  or
#赋值运算符：=  赋值运算符    将等号右边的赋给等号左边的
a , b , c = 20 , 20 , 4
e:bool = a==b and  c == b
print(e)
#这里仅用逻辑运算符做例子

# and 相当于高中的且
# or 相当于或
# not 相当于非


#         +=  加法赋值运算符  c += a <=> c = c + a
#         -=  减法赋值运算符  c —= a <=> c = c - a
#         *=  乘法赋值运算符  c *= a <=> c = c * a
#         /=  除法赋值运算符  c /= a <=> c = c / a
#         %=  取余赋值运算符  c %= a <=> c = c % a
#        **=  幂运算赋值运算符c **= a <=> c = c ** a
#        //=   取整赋值运算符 c//= a <=> c = c // a
#               最多能被多少个它除
a,b,c,d,e = 10,3,4,5,12
e%=c
print(e)

